app/controllers/api/v1/messages_controller.rb

      def create
        room = Room.find_by_title message_params['room_title']
        body = message_params['message']

        if room.blank?
          render json: { room: 'not found' }, status: :not_found
        elsif body.blank?
          render json: { message: 'cant be blank' }, status: :unprocessable_entity
        else
          guest_user = User.find_by_email('guest@mail.ru')
          @message = Message.create(room:, body:, user: guest_user)
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."title" = $1 LIMIT $2  [["title", "222"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "guest@mail.ru"], ["LIMIT", 1]]
INSERT INTO "messages" ("user_id", "room_id", "body", "created_at", "updated_at", "likes_count") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 3], ["room_id", 36], ["body", "IamfroASI"], ["created_at", "2023-12-24 15:35:01.080545"], ["updated_at", "2023-12-24 15:35:01.080545"], ["likes_count", 0]]