app/controllers/api/v1/rooms_controller.rb

SELECT "rooms".* FROM "rooms" ORDER BY created_at DESC
---
      def index
        @rooms = Room.order('created_at DESC')