app/controllers/messages_controller.rb

  def create
    @new_message = current_user&.messages&.build(message_params)

    if @new_message&.save
---
INSERT INTO "messages" ("user_id", "room_id", "body", "created_at", "updated_at", "likes_count") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["room_id", 32], ["body", "sdadsadasdsadas"], ["created_at", "2023-12-24 12:02:05.159333"], ["updated_at", "2023-12-24 12:02:05.159333"], ["likes_count", 0]]

  def like
    @message = Message.find(params[:id])

    like = @message.likes.find_by(user: current_user)

    if like.present?
      like.destroy
    else
      @message.likes.create(user: current_user)
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."message_id" = $1 AND "likes"."user_id" = $2 LIMIT $3  [["message_id", 1], ["user_id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."message_id" = $1 AND "likes"."user_id" = $2 LIMIT $3  [["message_id", 3], ["user_id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]
INSERT INTO "likes" ("user_id", "message_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["message_id", 1], ["created_at", "2023-12-24 12:02:09.678855"], ["updated_at", "2023-12-24 12:02:09.678855"]]