app/controllers/rooms_controller.rb

  def create
    @room = current_user.rooms.build(room_params)

    if @room.save
---
INSERT INTO "rooms" ("user_id", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["title", "ssdsadsad"], ["created_at", "2023-12-24 11:48:11.659486"], ["updated_at", "2023-12-24 11:48:11.659486"]]

  def show
    @room = Room.find_by!(title: params[:title])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."title" = $1 LIMIT $2  [["title", "1111"], ["LIMIT", 1]]